# EnergyAnalysis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..EnergyAnalysis Property
GroupTypeId Class See Also
---
Energy Analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysis {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace